lisp/clisp/httpd/single_process/newbench.log
httperf --hog --client=0/1 --server=localhost --port=8080 --uri=/ --send-buffer=4096 --recv-buffer=16384 --num-conns=300 --num-calls=1
Maximum connect burst length: 1

Total: connections 300 requests 300 replies 300 test-duration 0.477 s

Connection rate: 629.4 conn/s (1.6 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 1.2 avg 1.6 max 91.0 median 1.5 stddev 5.2
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 629.4 req/s (1.6 ms/req)
Request size [B]: 62.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 1.5 transfer 0.0
Reply size [B]: header 42.0 content 73.0 footer 0.0 (total 115.0)
Reply status: 1xx=0 2xx=300 3xx=0 4xx=0 5xx=0

CPU time [s]: user 0.07 system 0.12 (user 14.8% system 24.5% total 39.3%)
Net I/O: 108.8 KB/s (0.9*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
httperf --hog --client=0/1 --server=localhost --port=8080 --uri=/ --send-buffer=4096 --recv-buffer=16384 --num-conns=300 --num-calls=1
Maximum connect burst length: 1

Total: connections 300 requests 300 replies 300 test-duration 0.407 s

Connection rate: 737.1 conn/s (1.4 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 1.2 avg 1.4 max 20.3 median 1.5 stddev 1.2
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 737.1 req/s (1.4 ms/req)
Request size [B]: 62.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 1.3 transfer 0.0
Reply size [B]: header 42.0 content 73.0 footer 0.0 (total 115.0)
Reply status: 1xx=0 2xx=300 3xx=0 4xx=0 5xx=0

CPU time [s]: user 0.03 system 0.09 (user 7.4% system 21.5% total 28.9%)
Net I/O: 127.4 KB/s (1.0*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
httperf --hog --client=0/1 --server=localhost --port=8080 --uri=/ --send-buffer=4096 --recv-buffer=16384 --num-conns=300 --num-calls=1
Maximum connect burst length: 1

Total: connections 300 requests 300 replies 300 test-duration 0.402 s

Connection rate: 746.9 conn/s (1.3 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 1.2 avg 1.3 max 7.7 median 1.5 stddev 0.7
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 746.9 req/s (1.3 ms/req)
Request size [B]: 62.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 1.3 transfer 0.0
Reply size [B]: header 42.0 content 73.0 footer 0.0 (total 115.0)
Reply status: 1xx=0 2xx=300 3xx=0 4xx=0 5xx=0

CPU time [s]: user 0.03 system 0.08 (user 6.8% system 19.9% total 26.7%)
Net I/O: 129.1 KB/s (1.1*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
httperf --hog --client=0/1 --server=localhost --port=8080 --uri=/ --send-buffer=4096 --recv-buffer=16384 --num-conns=300 --num-calls=1
Maximum connect burst length: 1

Total: connections 300 requests 300 replies 300 test-duration 0.427 s

Connection rate: 702.4 conn/s (1.4 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 1.2 avg 1.4 max 40.2 median 1.5 stddev 2.3
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 702.4 req/s (1.4 ms/req)
Request size [B]: 62.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 1.4 transfer 0.0
Reply size [B]: header 42.0 content 73.0 footer 0.0 (total 115.0)
Reply status: 1xx=0 2xx=300 3xx=0 4xx=0 5xx=0

CPU time [s]: user 0.04 system 0.10 (user 8.6% system 23.8% total 32.5%)
Net I/O: 121.4 KB/s (1.0*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
httperf --hog --client=0/1 --server=localhost --port=8080 --uri=/ --send-buffer=4096 --recv-buffer=16384 --num-conns=300 --num-calls=1
Maximum connect burst length: 1

Total: connections 300 requests 300 replies 300 test-duration 0.456 s

Connection rate: 657.9 conn/s (1.5 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 1.2 avg 1.5 max 65.9 median 1.5 stddev 3.8
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 657.9 req/s (1.5 ms/req)
Request size [B]: 62.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 1.5 transfer 0.0
Reply size [B]: header 42.0 content 73.0 footer 0.0 (total 115.0)
Reply status: 1xx=0 2xx=300 3xx=0 4xx=0 5xx=0

CPU time [s]: user 0.07 system 0.10 (user 14.8% system 20.9% total 35.6%)
Net I/O: 113.7 KB/s (0.9*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
httperf --hog --client=0/1 --server=localhost --port=8080 --uri=/ --send-buffer=4096 --recv-buffer=16384 --num-conns=300 --num-calls=1
Maximum connect burst length: 1

Total: connections 300 requests 300 replies 300 test-duration 0.391 s

Connection rate: 766.7 conn/s (1.3 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 1.2 avg 1.3 max 6.3 median 1.5 stddev 0.5
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 766.7 req/s (1.3 ms/req)
Request size [B]: 62.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 1.3 transfer 0.0
Reply size [B]: header 42.0 content 73.0 footer 0.0 (total 115.0)
Reply status: 1xx=0 2xx=300 3xx=0 4xx=0 5xx=0

CPU time [s]: user 0.01 system 0.09 (user 2.1% system 24.0% total 26.1%)
Net I/O: 132.5 KB/s (1.1*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
httperf --hog --client=0/1 --server=localhost --port=8080 --uri=/ --send-buffer=4096 --recv-buffer=16384 --num-conns=300 --num-calls=1
Maximum connect burst length: 1

Total: connections 300 requests 300 replies 300 test-duration 0.470 s

Connection rate: 638.6 conn/s (1.6 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 1.2 avg 1.6 max 80.0 median 1.5 stddev 4.6
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 638.6 req/s (1.6 ms/req)
Request size [B]: 62.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 1.5 transfer 0.0
Reply size [B]: header 42.0 content 73.0 footer 0.0 (total 115.0)
Reply status: 1xx=0 2xx=300 3xx=0 4xx=0 5xx=0

CPU time [s]: user 0.04 system 0.14 (user 7.7% system 30.3% total 38.0%)
Net I/O: 110.4 KB/s (0.9*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0
httperf --hog --client=0/1 --server=localhost --port=8080 --uri=/ --send-buffer=4096 --recv-buffer=16384 --num-conns=300 --num-calls=1
Maximum connect burst length: 1

Total: connections 300 requests 300 replies 300 test-duration 0.416 s

Connection rate: 721.0 conn/s (1.4 ms/conn, <=1 concurrent connections)
Connection time [ms]: min 1.2 avg 1.4 max 23.2 median 1.5 stddev 1.4
Connection time [ms]: connect 0.0
Connection length [replies/conn]: 1.000

Request rate: 721.0 req/s (1.4 ms/req)
Request size [B]: 62.0

Reply rate [replies/s]: min 0.0 avg 0.0 max 0.0 stddev 0.0 (0 samples)
Reply time [ms]: response 1.3 transfer 0.0
Reply size [B]: header 42.0 content 73.0 footer 0.0 (total 115.0)
Reply status: 1xx=0 2xx=300 3xx=0 4xx=0 5xx=0

CPU time [s]: user 0.03 system 0.10 (user 6.3% system 23.0% total 29.2%)
Net I/O: 124.6 KB/s (1.0*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 other 0